InformationRegisters/ДБ_НастройкиПроверкиДублей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ДБ_НастройкиПроверкиДублей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбластьПоискаДублей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаименованиеНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ДБ_ДействиеПослеПроверкиДублей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Enum>
		<Properties>
			<Name>ДБ_ДействиеПослеПроверкиДублей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Предупреждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказОтЗаписи</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПоступлениеТоваровУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПоступлениеТоваровУслуг</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/ДБ_ПроверкаДублей/Ext/Module.bsl
Процедура ПроверкаДублейОбработкаПередЗаписью(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка ИЛИ НЕ ИспользоватьПроверкуДублейСправочников() ИЛИ НЕ Источник.ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДБ_НастройкиПроверкиДублей.Настройка КАК Настройка
	|ИЗ
	|	РегистрСведений.ДБ_НастройкиПроверкиДублей КАК ДБ_НастройкиПроверкиДублей
	|ГДЕ
	|	ДБ_НастройкиПроверкиДублей.ОбластьПоискаДублей = &ОбластьПоискаДублей";
	
	Запрос.УстановитьПараметр("ОбластьПоискаДублей", Источник.Метаданные().ПолноеИмя());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НастройкиПоискаДублей = Выборка.Настройка.Получить();  
		
		Если НастройкиПоискаДублей.ПравилаПоиска.Количество() Тогда
			
			Запрос = Новый Запрос;
			
			НастройкиПоискаДублей.ПравилаПоиска.ВыгрузитьКолонку("Реквизит");
			
			ТекстЗапроса = "ВЫБРАТЬ " + Источник.Метаданные().Имя + ".Ссылка" + " ИЗ " + Источник.Метаданные().ПолноеИмя() + " КАК " + Источник.Метаданные().Имя + " ГДЕ ";
			
			Реквизиты = Новый Массив;
			
			Для Каждого Строка Из НастройкиПоискаДублей.ПравилаПоиска Цикл
				Если НЕ ПустаяСтрока(Строка.Правило) Тогда
					Реквизиты.Добавить(Источник.Метаданные().Имя + "." + Строка.Реквизит + " = &" + Строка.Реквизит)
				КонецЕсли;
			КонецЦикла;
			
			Запрос.Текст = ТекстЗапроса + СтрСоединить(Реквизиты, " И ");
			
			Для Каждого Отбор Из НастройкиПоискаДублей.ПравилаПоиска Цикл
				Если НЕ ПустаяСтрока(Отбор.Правило) Тогда  
					ЗначениеОтбора = ?(Отбор.Правило = "Подобно", "%" + Источник[Отбор.Реквизит] + "%", Источник[Отбор.Реквизит]);
					Запрос.УстановитьПараметр(Отбор.Реквизит, ЗначениеОтбора)
				КонецЕсли;
			КонецЦикла;
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Если РезультатЗапроса.Пустой() Тогда
				Возврат;
			Иначе    
				Отказ = ?(НастройкиПоискаДублей.ДействиеПослеПроверкиДублей = Перечисления.ДБ_ДействиеПослеПроверкиДублей.ОтказОтЗаписи, Истина, Ложь);
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = СтрШаблон(НСтр("ru='Потенциальный дубль, настройки проверки дублей смотри в Администрирование - Настройка расширения ДБ'"));
				Сообщение.Сообщить(); 
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ЕстьПохожееПоступление(ДокументПоступления) Экспорт
	
	Если НЕ Константы.ДБ_ПроверятьВходящийНомерПоступлениеТоваровУслуг.Получить() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеТоваровУслуг.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(ПоступлениеТоваровУслуг.ДатаВходящегоДокумента, ГОД) = &ДатаВходящегоДокумента
		|	И СОКРЛП(ПоступлениеТоваровУслуг.НомерВходящегоДокумента) = &НомерВходящегоДокумента
		|	И ПоступлениеТоваровУслуг.Контрагент = &Контрагент
		|	И НЕ ПоступлениеТоваровУслуг.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("ДатаВходящегоДокумента",	 НачалоГода(ДокументПоступления.ДатаВходящегоДокумента));
	Запрос.УстановитьПараметр("НомерВходящегоДокумента", СокрЛП(ДокументПоступления.НомерВходящегоДокумента));
	Запрос.УстановитьПараметр("Контрагент",				 ДокументПоступления.Контрагент);
	Запрос.УстановитьПараметр("Ссылка",	 				 ДокументПоступления.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции // ЕстьПохожееПоступление()

Функция ИспользоватьПроверкуДублейСправочников()
	
	Возврат Константы.ДБ_ИспользоватьПроверкуДублейСправочников.Получить();
	
КонецФункции // ИспользоватьПроверкуДублейСправочников()
